# -*- coding: cp1251 -*-
from telebot import types
import SQLLib as sql
import os
import telebot
import sqlite3

token = "973541236:AAFLvoGUV1btTIYuoJ8i4NxXv2K4gGrQiBY"
bot = telebot.TeleBot(token)


groups = ['АДБ-18-01', 'АДБ-18-02', 'АДБ-18-03', 'АДБ-18-06', 'АДБ-18-07', 'АДБ-18-08', 'АДБ-18-09', 'АДБ-18-10', 'АДБ-18-11', 'АДБ-19-01', 'АДБ-19-02', 'АДБ-19-03', 'АДБ-19-06', 'АДБ-19-07', 'АДБ-19-08', 'АДБ-19-09', 'АДБ-19-10', 'АДБ-19-11', 'АДБ-20-01', 'АДБ-20-02', 'АДБ-20-03', 'АДБ-20-06', 'АДБ-20-07', 'АДБ-20-08', 'АДБ-20-09', 'АДБ-20-10', 'АДБ-20-11', 'АДБ-20-12', 'АДБ-21-01', 'АДБ-21-02', 'АДБ-21-03', 'АДБ-21-04', 'АДБ-21-06', 'АДБ-21-07', 'АДБ-21-08', 'АДБ-21-09', 'АДБ-21-10', 'АДБ-21-11', 'АДМ-20-03', 'АДМ-20-04', 'АДМ-21-01', 'АДМ-21-02', 'АДМ-21-03', 'АДМ-21-04', 'АДМ-21-05', 'АДМ-21-06', 'АСП-19-01(09-01)', 'АСП-19-01(09-02)', 'АСП-19-02(15-01)', 'АСП-19-02(15-02)', 'АСП-19-02(15-03)', 'АСП-20-01', 'АСП-20-02(15-01)', 'АСП-20-02(15-02)', 'АСП-20-03', 'АСП-21-01', 'АСП-21-02', 'АСП-21-03', 'ИДБ-18-01', 'ИДБ-18-02', 'ИДБ-18-03', 'ИДБ-18-04', 'ИДБ-18-05', 'ИДБ-18-06', 'ИДБ-18-07', 'ИДБ-18-08', 'ИДБ-18-09', 'ИДБ-18-10', 'ИДБ-18-11', 'ИДБ-19-01', 'ИДБ-19-02', 'ИДБ-19-04', 'ИДБ-19-05', 'ИДБ-19-06', 'ИДБ-19-07', 'ИДБ-19-08', 'ИДБ-19-09', 'ИДБ-19-10', 'ИДБ-19-11', 'ИДБ-20-01', 'ИДБ-20-02', 'ИДБ-20-03', 'ИДБ-20-04', 'ИДБ-20-05', 'ИДБ-20-06', 'ИДБ-20-07', 'ИДБ-20-08', 'ИДБ-20-09', 'ИДБ-20-10', 'ИДБ-20-11', 'ИДБ-21-01', 'ИДБ-21-02', 'ИДБ-21-03', 'ИДБ-21-04', 'ИДБ-21-05', 'ИДБ-21-06', 'ИДБ-21-07', 'ИДБ-21-08', 'ИДБ-21-09', 'ИДБ-21-10', 'ИДБ-21-11', 'ИДБ-21-12', 'ИДМ-20-01', 'ИДМ-20-02', 'ИДМ-20-03(ИГ)', 'ИДМ-20-03(ПрМ)', 'ИДМ-20-03(ФМ)', 'ИДМ-20-04', 'ИДМ-20-05', 'ИДМ-20-06', 'ИДМ-21-01', 'ИДМ-21-02', 'ИДМ-21-03(ИГ)', 'ИДМ-21-03(ПрМ)', 'ИДМ-21-03(ФМ)', 'ИДМ-21-04', 'ИДМ-21-05', 'ИДМ-21-06', 'ИДМ-21-07', 'ИДМ-21-08', 'МДБ-18-03', 'МДБ-18-04', 'МДБ-18-05', 'МДБ-18-06', 'МДБ-18-07', 'МДБ-18-08', 'МДБ-19-03', 'МДБ-19-04', 'МДБ-19-05', 'МДБ-19-06', 'МДБ-19-07', 'МДБ-19-09', 'МДБ-19-10', 'МДБ-20-03', 'МДБ-20-04', 'МДБ-20-05', 'МДБ-20-06', 'МДБ-20-07', 'МДБ-20-09', 'МДБ-20-10', 'МДБ-20-12', 'МДБ-21-03(02)', 'МДБ-21-03(05)', 'МДБ-21-04', 'МДБ-21-05', 'МДБ-21-06', 'МДБ-21-07', 'МДБ-21-09', 'МДМ-20-01', 'МДМ-20-02', 'МДМ-20-03', 'МДМ-20-04(СПД)', 'МДМ-20-04(СТ)', 'МДМ-20-06', 'МДМ-20-07', 'МДМ-21-01(КМ)', 'МДМ-21-01(ТМ)', 'МДМ-21-02', 'МДМ-21-03', 'МДМ-21-04(СПД)', 'МДМ-21-04(СТ)', 'МДМ-21-06', 'МДМ-21-07', 'МДМ-21-11', 'МДМ-21-12', 'МДС-17-01', 'МДС-17-02', 'МДС-18-01', 'МДС-18-02', 'МДС-19-01', 'МДС-19-02', 'МДС-20-01', 'МДС-20-02', 'МДС-20-11', 'МДС-21-01', 'МДС-21-02', 'МДС-21-11', 'ЭВМ-20-01(МВБ)', 'ЭВМ-20-01(УЧР)', 'ЭВМ-20-01(ФМ)', 'ЭВМ-21-01(ГМУ)', 'ЭВМ-21-01(МВБ)', 'ЭВМ-21-01(УП)', 'ЭВМ-21-01(УЧР)', 'ЭВМ-21-01(ФМ)', 'ЭДБ-18-01', 'ЭДБ-18-02(ПМ)', 'ЭДБ-18-02(УПр)', 'ЭДБ-18-03', 'ЭДБ-18-04', 'ЭДБ-18-05', 'ЭДБ-19-01', 'ЭДБ-19-02(УП)', 'ЭДБ-19-02(УПр)', 'ЭДБ-19-03', 'ЭДБ-19-05', 'ЭДБ-19-06', 'ЭДБ-20-01(ИН)', 'ЭДБ-20-01', 'ЭДБ-20-02(УП)', 'ЭДБ-20-02(УПр)', 'ЭДБ-20-02(УЧР)', 'ЭДБ-20-05', 'ЭДБ-20-08', 'ЭДБ-21-01', 'ЭДБ-21-02(02)', 'ЭДБ-21-02(03)', 'ЭДБ-21-03', 'ЭДБ-21-05', 'ЭДБ-21-06', 'ЭДБ-21-09', 'ЭДБ-21-10', 'ЭДМ-20-02(МВБ)', 'ЭДМ-20-02(УЧР)', 'ЭДМ-20-02(ФМ)', 'ЭДМ-20-05', 'ЭДМ-21-02(ГМУ)', 'ЭДМ-21-02(МВБ)', 'ЭДМ-21-02(УП)', 'ЭДМ-21-02(УЧР)', 'ЭДМ-21-02(ФМ)', 'ЭДМ-21-04', 'ЭДМ-21-05', 'ЭДМ-21-08', 'ЭДМ-21-09']


@bot.message_handler(commands=['start'])
def start(message):  # отправить сообщение со списком всех групп
    bot.send_message(message.chat.id, 'Отправьте название своей группы!\nСписок групп можно посмотреть тут:\nссылка')


@bot.message_handler(content_types=['text'])
def message_hand(message):
    if sql.get_state(message.chat.id) == '/start':
        if message.text in groups:
            bot.send_message(message.chat.id, 'Отлично!') # реализовать добавление группы в БД и смену state
        else:
            pass # реализовать обработку неверной группы


bot.infinity_polling()
